irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_spi_5123_IUT.c
    CS_CMM_PROBE_NODE_STMT(172,6,2) RCC_APB2PeriphResetCmd(((uint32_t)0x00001000), ENABLE);

    RCC_APB2PeriphResetCmd(((uint32_t)0x00001000), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(172,5,3) if (SPIx == ((SPI_TypeDef *) (((uint32_t)0x40000000) + 0x3800)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable811,778) 

    
    CS_CMM_PROBE_NODE_STMT(172,4,4) RCC_APB1PeriphResetCmd(((uint32_t)0x00004000), ENABLE);

    RCC_APB1PeriphResetCmd(((uint32_t)0x00004000), DISABLE);
  }
  else
  {
    
    CS_CMM_PROBE_NODE_STMT(172,3,5) if (SPIx == ((SPI_TypeDef *) (((uint32_t)0x40000000) + 0x3C00)))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable812,779) 

      
      CS_CMM_PROBE_NODE_STMT(172,2,6) RCC_APB1PeriphResetCmd(((uint32_t)0x00008000), ENABLE);

      RCC_APB1PeriphResetCmd(((uint32_t)0x00008000), DISABLE);
    } CS_CMM_ELSE_PROBE_C1(780) 
  }
  }

CS_CMM_PROBE_NODE_STMT(172,1,7) 
 CODESCROLL_FUNC_END(323, 21, 147) } CODESCROLL_FUNC_END_RBRACE 
/* # 157 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_Init(SPI_TypeDef* SPIx, SPI_InitTypeDef* SPI_InitStruct)
{ CODESCROLL_FUNC_BEGIN(324, (324, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable813,781) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable814,172,0,0)

  uint16_t tmpreg = 0;


  ((void)0);


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);



  tmpreg = SPIx->CR1;

  tmpreg &= ((uint16_t)0x3040);
/* # 188 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
  tmpreg |= (uint16_t)((uint32_t)SPI_InitStruct->SPI_Direction | SPI_InitStruct->SPI_Mode |
                  SPI_InitStruct->SPI_DataSize | SPI_InitStruct->SPI_CPOL |
                  SPI_InitStruct->SPI_CPHA | SPI_InitStruct->SPI_NSS |
                  SPI_InitStruct->SPI_BaudRatePrescaler | SPI_InitStruct->SPI_FirstBit);

  SPIx->CR1 = tmpreg;


  SPIx->I2SCFGR &= ((uint16_t)0xF7FF);



  SPIx->CRCPR = SPI_InitStruct->SPI_CRCPolynomial;

CS_CMM_PROBE_NODE_STMT(173,7,1) 
 CODESCROLL_FUNC_END(324, 21, 201) } CODESCROLL_FUNC_END_RBRACE 
/* # 218 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void I2S_Init(SPI_TypeDef* SPIx, I2S_InitTypeDef* I2S_InitStruct)
{ CODESCROLL_FUNC_BEGIN(325, (325, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable815,782) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable816,173,6,0)

  uint16_t tmpreg = 0, i2sdiv = 2, i2sodd = 0, packetlength = 1;
  uint32_t tmp = 0;
  RCC_ClocksTypeDef RCC_Clocks;
  uint32_t sourceclock = 0;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);



  SPIx->I2SCFGR &= ((uint16_t)0xF040);
  SPIx->I2SPR = 0x0002;


  tmpreg = SPIx->I2SCFGR;


  
  CS_CMM_PROBE_NODE_STMT(173,5,1) if(I2S_InitStruct->I2S_AudioFreq == ((uint32_t)2))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable817,783) 
    
    CS_CMM_PROBE_NODE_STMT(173,4,2) i2sodd = (uint16_t)0;
    i2sdiv = (uint16_t)2;
  }

  else
  {

    
    CS_CMM_PROBE_NODE_STMT(173,3,3) if(I2S_InitStruct->I2S_DataFormat == ((uint16_t)0x0000))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable818,784) 

      
      CS_CMM_PROBE_NODE_STMT(173,2,4) packetlength = 1;
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable819,785) 

      
      CS_CMM_PROBE_NODE_STMT(173,1,5) packetlength = 2;
    }


    
    CS_CMM_PROBE_NODE_STMT(173,0,6) if(((uint32_t)SPIx) == (((uint32_t)0x40000000) + 0x3800))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable820,786) 

      
      CS_CMM_PROBE_NODE_STMT(174,7,7) tmp = ((uint32_t)(0x00020000));
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable821,787) 

      
      CS_CMM_PROBE_NODE_STMT(174,6,8) tmp = ((uint32_t)(0x00040000));
    }




    
    CS_CMM_PROBE_NODE_STMT(174,5,9) if((((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 & tmp) != 0)
    {

      
      CS_CMM_PROBE_NODE_STMT(174,4,10) tmp = (uint32_t)((((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 & ((uint32_t)(0x0000F000))) >> 12);


      
      CS_CMM_PROBE_NODE_STMT(174,3,11) if(CS_MCDC_325_4((tmp > 5), (tmp < 15), 45))
      { CS_CMM_PROBE_DECL_CX(CodeScrollVariable822,30) 

        
        CS_CMM_PROBE_NODE_STMT(174,2,12) tmp += 2;
      }
      else
      {
        
        CS_CMM_PROBE_NODE_STMT(174,1,13) if (tmp == 15)
        { CS_CMM_PROBE_DECL_C1(CodeScrollVariable823,788) 

          
          CS_CMM_PROBE_NODE_STMT(174,0,14) tmp = 20;
        } CS_CMM_ELSE_PROBE_C1(789) 
      }

      
      CS_CMM_PROBE_NODE_STMT(175,7,15) sourceclock = (uint32_t)(((((RCC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x1000))->CFGR2 & ((uint32_t)(0x000000F0))) >> 4) + 1);


      sourceclock = (uint32_t) ((((uint32_t)25000000) / sourceclock) * tmp * 2);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable824,790) 

      
      CS_CMM_PROBE_NODE_STMT(175,6,16) RCC_GetClocksFreq(&RCC_Clocks);


      sourceclock = RCC_Clocks.SYSCLK_Frequency;
    }
/* # 320 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
    
    CS_CMM_PROBE_NODE_STMT(175,5,17) if(I2S_InitStruct->I2S_MCLKOutput == ((uint16_t)0x0200))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable825,791) 

      
      CS_CMM_PROBE_NODE_STMT(175,4,18) tmp = (uint16_t)(((((sourceclock / 256) * 10) / I2S_InitStruct->I2S_AudioFreq)) + 5);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable826,792) 

      
      CS_CMM_PROBE_NODE_STMT(175,3,19) tmp = (uint16_t)(((((sourceclock / (32 * packetlength)) *10 ) / I2S_InitStruct->I2S_AudioFreq)) + 5);
    }


    
