irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_spi_5123_IUT.c
    CS_CMM_PROBE_NODE_STMT(175,2,20) tmp = tmp / 10;


    i2sodd = (uint16_t)(tmp & (uint16_t)0x0001);


    i2sdiv = (uint16_t)((tmp - i2sodd) / 2);


    i2sodd = (uint16_t) (i2sodd << 8);
  }


  
  CS_CMM_PROBE_NODE_STMT(175,1,21) if (CS_MCDC_325_7((i2sdiv < 2), (i2sdiv > 0xFF), 48))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable827,31) 

    
    CS_CMM_PROBE_NODE_STMT(175,0,22) i2sdiv = 2;
    i2sodd = 0;
  } CS_CMM_ELSE_PROBE_CX(32) 


  
  CS_CMM_PROBE_NODE_STMT(176,7,23) SPIx->I2SPR = (uint16_t)(i2sdiv | (uint16_t)(i2sodd | (uint16_t)I2S_InitStruct->I2S_MCLKOutput));


  tmpreg |= (uint16_t)(((uint16_t)0x0800) | (uint16_t)(I2S_InitStruct->I2S_Mode | (uint16_t)(I2S_InitStruct->I2S_Standard | (uint16_t)(I2S_InitStruct->I2S_DataFormat | (uint16_t)I2S_InitStruct->I2S_CPOL))));




  SPIx->I2SCFGR = tmpreg;

CS_CMM_PROBE_NODE_STMT(176,6,24) 
 CODESCROLL_FUNC_END(325, 21, 362) } CODESCROLL_FUNC_END_RBRACE 






void SPI_StructInit(SPI_InitTypeDef* SPI_InitStruct)
{ CODESCROLL_FUNC_BEGIN(326, (326, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable828,793) 


  
  CS_CMM_PROBE_NODE_STMT(176,5,0) SPI_InitStruct->SPI_Direction = ((uint16_t)0x0000);

  SPI_InitStruct->SPI_Mode = ((uint16_t)0x0000);

  SPI_InitStruct->SPI_DataSize = ((uint16_t)0x0000);

  SPI_InitStruct->SPI_CPOL = ((uint16_t)0x0000);

  SPI_InitStruct->SPI_CPHA = ((uint16_t)0x0000);

  SPI_InitStruct->SPI_NSS = ((uint16_t)0x0000);

  SPI_InitStruct->SPI_BaudRatePrescaler = ((uint16_t)0x0000);

  SPI_InitStruct->SPI_FirstBit = ((uint16_t)0x0000);

  SPI_InitStruct->SPI_CRCPolynomial = 7;

CS_CMM_PROBE_NODE_STMT(176,4,1) 
 CODESCROLL_FUNC_END(326, 21, 390) } CODESCROLL_FUNC_END_RBRACE 






void I2S_StructInit(I2S_InitTypeDef* I2S_InitStruct)
{ CODESCROLL_FUNC_BEGIN(327, (327, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable829,794) 


  
  CS_CMM_PROBE_NODE_STMT(176,3,0) I2S_InitStruct->I2S_Mode = ((uint16_t)0x0000);


  I2S_InitStruct->I2S_Standard = ((uint16_t)0x0000);


  I2S_InitStruct->I2S_DataFormat = ((uint16_t)0x0000);


  I2S_InitStruct->I2S_MCLKOutput = ((uint16_t)0x0000);


  I2S_InitStruct->I2S_AudioFreq = ((uint32_t)2);


  I2S_InitStruct->I2S_CPOL = ((uint16_t)0x0000);

CS_CMM_PROBE_NODE_STMT(176,2,1) 
 CODESCROLL_FUNC_END(327, 21, 417) } CODESCROLL_FUNC_END_RBRACE 
/* # 426 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_Cmd(SPI_TypeDef* SPIx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(328, (328, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable830,795) 

  
  CS_CMM_PROBE_NODE_STMT(176,1,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(176,0,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable831,796) 

    
    CS_CMM_PROBE_NODE_STMT(177,7,2) SPIx->CR1 |= ((uint16_t)0x0040);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable832,797) 

    
    CS_CMM_PROBE_NODE_STMT(177,6,3) SPIx->CR1 &= ((uint16_t)0xFFBF);
  }

CS_CMM_PROBE_NODE_STMT(177,5,4) 
 CODESCROLL_FUNC_END(328, 21, 441) } CODESCROLL_FUNC_END_RBRACE 
/* # 450 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void I2S_Cmd(SPI_TypeDef* SPIx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(329, (329, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable833,798) 

  
  CS_CMM_PROBE_NODE_STMT(177,4,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(177,3,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable834,799) 

    
    CS_CMM_PROBE_NODE_STMT(177,2,2) SPIx->I2SCFGR |= ((uint16_t)0x0400);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable835,800) 

    
    CS_CMM_PROBE_NODE_STMT(177,1,3) SPIx->I2SCFGR &= ((uint16_t)0xFBFF);
  }

CS_CMM_PROBE_NODE_STMT(177,0,4) 
 CODESCROLL_FUNC_END(329, 21, 465) } CODESCROLL_FUNC_END_RBRACE 
/* # 481 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_I2S_ITConfig(SPI_TypeDef* SPIx, uint8_t SPI_I2S_IT, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(330, (330, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable836,801) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable837,178,7,0)

  uint16_t itpos = 0, itmask = 0 ;

  ((void)0);
  ((void)0);
  ((void)0);


  itpos = SPI_I2S_IT >> 4;


  itmask = (uint16_t)1 << (uint16_t)itpos;

  
  CS_CMM_PROBE_NODE_STMT(178,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable838,802) 

    
    CS_CMM_PROBE_NODE_STMT(178,5,2) SPIx->CR2 |= itmask;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable839,803) 

    
    CS_CMM_PROBE_NODE_STMT(178,4,3) SPIx->CR2 &= (uint16_t)~itmask;
  }

CS_CMM_PROBE_NODE_STMT(178,3,4) 
 CODESCROLL_FUNC_END(330, 21, 505) } CODESCROLL_FUNC_END_RBRACE 
/* # 520 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_I2S_DMACmd(SPI_TypeDef* SPIx, uint16_t SPI_I2S_DMAReq, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(331, (331, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable840,804) 

  
  CS_CMM_PROBE_NODE_STMT(178,2,0) ((void)0);
  ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(178,1,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable841,805) 

    
    CS_CMM_PROBE_NODE_STMT(178,0,2) SPIx->CR2 |= SPI_I2S_DMAReq;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable842,806) 

    
    CS_CMM_PROBE_NODE_STMT(179,7,3) SPIx->CR2 &= (uint16_t)~SPI_I2S_DMAReq;
  }

CS_CMM_PROBE_NODE_STMT(179,6,4) 
 CODESCROLL_FUNC_END(331, 21, 536) } CODESCROLL_FUNC_END_RBRACE 
/* # 546 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_I2S_SendData(SPI_TypeDef* SPIx, uint16_t Data)
{ CODESCROLL_FUNC_BEGIN(332, (332, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable843,807) 

  
