irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_spi_5123_IUT.c
  CS_CMM_PROBE_NODE_STMT(179,5,0) ((void)0);


  SPIx->DR = Data;

CS_CMM_PROBE_NODE_STMT(179,4,1) 
 CODESCROLL_FUNC_END(332, 21, 553) } CODESCROLL_FUNC_END_RBRACE 
/* # 562 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
uint16_t SPI_I2S_ReceiveData(SPI_TypeDef* SPIx)
{ CODESCROLL_FUNC_BEGIN(333, (333, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable844,808) 

  
  CS_CMM_PROBE_NODE_STMT(179,3,0) ((void)0);


  
  CS_CMM_PROBE_NODE_STMT(179,2,1) 
   CODESCROLL_FUNC_END(333, 21, 568) return SPIx->DR;
} CODESCROLL_FUNC_END_RBRACE 
/* # 580 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_NSSInternalSoftwareConfig(SPI_TypeDef* SPIx, uint16_t SPI_NSSInternalSoft)
{ CODESCROLL_FUNC_BEGIN(334, (334, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable845,809) 

  
  CS_CMM_PROBE_NODE_STMT(179,1,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(179,0,1) if (SPI_NSSInternalSoft != ((uint16_t)0xFEFF))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable846,810) 

    
    CS_CMM_PROBE_NODE_STMT(180,7,2) SPIx->CR1 |= ((uint16_t)0x0100);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable847,811) 

    
    CS_CMM_PROBE_NODE_STMT(180,6,3) SPIx->CR1 &= ((uint16_t)0xFEFF);
  }

CS_CMM_PROBE_NODE_STMT(180,5,4) 
 CODESCROLL_FUNC_END(334, 21, 595) } CODESCROLL_FUNC_END_RBRACE 
/* # 604 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_SSOutputCmd(SPI_TypeDef* SPIx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(335, (335, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable848,812) 

  
  CS_CMM_PROBE_NODE_STMT(180,4,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(180,3,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable849,813) 

    
    CS_CMM_PROBE_NODE_STMT(180,2,2) SPIx->CR2 |= ((uint16_t)0x0004);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable850,814) 

    
    CS_CMM_PROBE_NODE_STMT(180,1,3) SPIx->CR2 &= ((uint16_t)0xFFFB);
  }

CS_CMM_PROBE_NODE_STMT(180,0,4) 
 CODESCROLL_FUNC_END(335, 21, 619) } CODESCROLL_FUNC_END_RBRACE 
/* # 630 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_DataSizeConfig(SPI_TypeDef* SPIx, uint16_t SPI_DataSize)
{ CODESCROLL_FUNC_BEGIN(336, (336, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable851,815) 

  
  CS_CMM_PROBE_NODE_STMT(181,7,0) ((void)0);
  ((void)0);

  SPIx->CR1 &= (uint16_t)~((uint16_t)0x0800);

  SPIx->CR1 |= SPI_DataSize;

CS_CMM_PROBE_NODE_STMT(181,6,1) 
 CODESCROLL_FUNC_END(336, 21, 639) } CODESCROLL_FUNC_END_RBRACE 






void SPI_TransmitCRC(SPI_TypeDef* SPIx)
{ CODESCROLL_FUNC_BEGIN(337, (337, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable852,816) 

  
  CS_CMM_PROBE_NODE_STMT(181,5,0) ((void)0);


  SPIx->CR1 |= ((uint16_t)0x1000);

CS_CMM_PROBE_NODE_STMT(181,4,1) 
 CODESCROLL_FUNC_END(337, 21, 653) } CODESCROLL_FUNC_END_RBRACE 
/* # 662 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_CalculateCRC(SPI_TypeDef* SPIx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(338, (338, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable853,817) 

  
  CS_CMM_PROBE_NODE_STMT(181,3,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(181,2,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable854,818) 

    
    CS_CMM_PROBE_NODE_STMT(181,1,2) SPIx->CR1 |= ((uint16_t)0x2000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable855,819) 

    
    CS_CMM_PROBE_NODE_STMT(181,0,3) SPIx->CR1 &= ((uint16_t)0xDFFF);
  }

CS_CMM_PROBE_NODE_STMT(182,7,4) 
 CODESCROLL_FUNC_END(338, 21, 677) } CODESCROLL_FUNC_END_RBRACE 
/* # 688 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
uint16_t SPI_GetCRC(SPI_TypeDef* SPIx, uint8_t SPI_CRC)
{ CODESCROLL_FUNC_BEGIN(339, (339, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable856,820) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable857,182,6,0)

  uint16_t crcreg = 0;

  ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(182,5,1) if (SPI_CRC != ((uint8_t)0x01))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable858,821) 

    
    CS_CMM_PROBE_NODE_STMT(182,4,2) crcreg = SPIx->TXCRCR;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable859,822) 

    
    CS_CMM_PROBE_NODE_STMT(182,3,3) crcreg = SPIx->RXCRCR;
  }

  
  CS_CMM_PROBE_NODE_STMT(182,2,4) 
   CODESCROLL_FUNC_END(339, 21, 705) return crcreg;
} CODESCROLL_FUNC_END_RBRACE 






uint16_t SPI_GetCRCPolynomial(SPI_TypeDef* SPIx)
{ CODESCROLL_FUNC_BEGIN(340, (340, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable860,823) 

  
  CS_CMM_PROBE_NODE_STMT(182,1,0) ((void)0);


  
  CS_CMM_PROBE_NODE_STMT(182,0,1) 
   CODESCROLL_FUNC_END(340, 21, 719) return SPIx->CRCPR;
} CODESCROLL_FUNC_END_RBRACE 
/* # 731 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_BiDirectionalLineConfig(SPI_TypeDef* SPIx, uint16_t SPI_Direction)
{ CODESCROLL_FUNC_BEGIN(341, (341, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable861,824) 

  
  CS_CMM_PROBE_NODE_STMT(183,7,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(183,6,1) if (SPI_Direction == ((uint16_t)0x4000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable862,825) 

    
