irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_spi_5123_IUT.c
    CS_CMM_PROBE_NODE_STMT(183,5,2) SPIx->CR1 |= ((uint16_t)0x4000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable863,826) 

    
    CS_CMM_PROBE_NODE_STMT(183,4,3) SPIx->CR1 &= ((uint16_t)0xBFFF);
  }

CS_CMM_PROBE_NODE_STMT(183,3,4) 
 CODESCROLL_FUNC_END(341, 21, 746) } CODESCROLL_FUNC_END_RBRACE 
/* # 765 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
FlagStatus SPI_I2S_GetFlagStatus(SPI_TypeDef* SPIx, uint16_t SPI_I2S_FLAG)
{ CODESCROLL_FUNC_BEGIN(342, (342, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable864,827) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable865,183,2,0)

  FlagStatus bitstatus = RESET;

  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(183,1,1) if ((SPIx->SR & SPI_I2S_FLAG) != (uint16_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable866,828) 

    
    CS_CMM_PROBE_NODE_STMT(183,0,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable867,829) 

    
    CS_CMM_PROBE_NODE_STMT(184,7,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(184,6,4) 
   CODESCROLL_FUNC_END(342, 21, 783) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 803 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_I2S_ClearFlag(SPI_TypeDef* SPIx, uint16_t SPI_I2S_FLAG)
{ CODESCROLL_FUNC_BEGIN(343, (343, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable868,830) 

  
  CS_CMM_PROBE_NODE_STMT(184,5,0) ((void)0);
  ((void)0);


    SPIx->SR = (uint16_t)~SPI_I2S_FLAG;

CS_CMM_PROBE_NODE_STMT(184,4,1) 
 CODESCROLL_FUNC_END(343, 21, 811) } CODESCROLL_FUNC_END_RBRACE 
/* # 828 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
ITStatus SPI_I2S_GetITStatus(SPI_TypeDef* SPIx, uint8_t SPI_I2S_IT)
{ CODESCROLL_FUNC_BEGIN(344, (344, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable869,831) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable870,184,3,0)

  ITStatus bitstatus = RESET;
  uint16_t itpos = 0, itmask = 0, enablestatus = 0;


  ((void)0);
  ((void)0);


  itpos = 0x01 << (SPI_I2S_IT & 0x0F);


  itmask = SPI_I2S_IT >> 4;


  itmask = 0x01 << itmask;


  enablestatus = (SPIx->CR2 & itmask) ;


  
  CS_CMM_PROBE_NODE_STMT(184,2,1) if (CS_MCDC_344_0(((SPIx->SR & itpos) != (uint16_t)RESET), enablestatus, 51))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable871,33) 

    
    CS_CMM_PROBE_NODE_STMT(184,1,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable872,34) 

    
    CS_CMM_PROBE_NODE_STMT(184,0,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(185,7,4) 
   CODESCROLL_FUNC_END(344, 21, 861) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 882 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_spi.c"*/
void SPI_I2S_ClearITPendingBit(SPI_TypeDef* SPIx, uint8_t SPI_I2S_IT)
{ CODESCROLL_FUNC_BEGIN(345, (345, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable873,832) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable874,185,6,0)

  uint16_t itpos = 0;

  ((void)0);
  ((void)0);


  itpos = 0x01 << (SPI_I2S_IT & 0x0F);


  SPIx->SR = (uint16_t)~itpos;

CS_CMM_PROBE_NODE_STMT(185,5,1) 
 CODESCROLL_FUNC_END(345, 21, 894) } CODESCROLL_FUNC_END_RBRACE 
